# 키워드

## 학습 키워드

- ERD(Entity-Relationship Model) 이란
- Entity
- 데이터베이스 정규화

# 내용

## 학습 키워드

- Entity-Relationship Model : 특정 도메인에서 상호 연결된 것들을 설명하는 것. 인기있는 개념적 데이터 모델.
- Entity : 독립적으로 존재하는 유일하게 식별되는 것.
- ERD : ER 모델을 시각화하는 방법. Crow's Foot Notation이 유명하고 많이 쓰임.
- 데이터베이스 정규화 : 데이터베이스 정규화는 데이터의 중복을 제거하는 행위임. 다양한 이상현상을 예방할 수있음.
- ER 모델에서 Relationship은 Entity 사이의 관계를 의미한다.
- 관계형 데이터베이스의 관계(Relation)를 ERM의 관계(Relationship)로 잘못 알고 있는 경우가 정말 많다. 주의할 것!

# 필기

## 학습 키워드

- 중요한것.
- 아티스트, 퍼포먼스,
- 관계.

entitytype은 entity의 집합.

- 클래스, 인터페이스...
- 시그네쳐, 그런것에서 출발하는 것이죠!
- 견우 ,직녀..
  엄격하게 안 따져 들었었죠!!
  객체지향에서 엔티티
  객체지향의 사실과 오해

- ERD(Entity-Relationship Model) 이란
- Entity
- 데이터베이스 정규화

비슷해보이는 것 . 그걸 정말 간 구별해라!!

맥락에서 어떻게 쓰는지..!!
섣불리 연결하지 마라!
주의해라..!!!
말이 되게 해라!!
하나의 지역이 여러개의 캐릭터를 포함한다.

연습을 해봐라!
많이 ERD 그려봐라!
